[Killed] BlockStatement
src/Roller.ts:6:32
     private _last: number;
     private _faces: number;
 
-    constructor(faces: number) {
-        if (faces < 2) {
-            faces = 6; // default to a 6-sided die
-        }
-        this._faces = faces;
-        this._last = 0;
-        this._distribution = new Map<number, number>();
-        for (let i = 1; i <= faces; i++) {
-            this._distribution.set(i, 0);
-        }
-    }
+    constructor(faces: number) {}
 
     roll(value: number): number {
killedBy: Roller tests Rolling a valid value should return that value
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[Survived] ConditionalExpression
src/Roller.ts:7:13
     private _faces: number;
 
     constructor(faces: number) {
-        if (faces < 2) {
+        if (false) {
             faces = 6; // default to a 6-sided die
         }

[Killed] ConditionalExpression
src/Roller.ts:13:25
         this._faces = faces;
         this._last = 0;
         this._distribution = new Map<number, number>();
-        for (let i = 1; i <= faces; i++) {
+        for (let i = 1; false; i++) {
             this._distribution.set(i, 0);
         }
killedBy: Roller tests Rolling a valid value should update last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] BlockStatement
src/Roller.ts:13:42
         this._faces = faces;
         this._last = 0;
         this._distribution = new Map<number, number>();
-        for (let i = 1; i <= faces; i++) {
-            this._distribution.set(i, 0);
-        }
+        for (let i = 1; i <= faces; i++) {}
     }
 
killedBy: Roller tests Rolling a valid value should update last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] BlockStatement
src/Roller.ts:18:33
         }
     }
 
-    roll(value: number): number {
-        if (value < 1 || value > this._faces) {
-            return 0;
-        }
-        this._last = value;
-        this._distribution.set(value, this._distribution.get(value) + 1);
-        return value;
-    }
+    roll(value: number): number {}
 
     last(): number {
killedBy: Roller tests Rolling a valid value should return that value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
src/Roller.ts:23:39
             return 0;
         }
         this._last = value;
-        this._distribution.set(value, this._distribution.get(value) + 1);
+        this._distribution.set(value, this._distribution.get(value) - 1);
         return value;
     }
killedBy: Roller tests Rolling a valid value should update last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/Roller.ts:27:20
         return value;
     }
 
-    last(): number {
-        return this._last;
-    }
+    last(): number {}
 
     distribution(): Map<number, number> {
killedBy: Roller tests Rolling a valid value should update last roll and distribution
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/Roller.ts:31:41
         return this._last;
     }
 
-    distribution(): Map<number, number> {
-        return new Map<number, number>(this._distribution);
-    }
+    distribution(): Map<number, number> {}
 }
 
killedBy: Roller tests Rolling a valid value should update last roll and distribution
statusReason: TypeError: Cannot read properties of undefined (reading 'get')
